nxp-mcuxpresso/mcux-soc-svd/MIMXRT1021/MIMXRT1021.xml
        <register>
          <name>GPR14</name>
          <description>GPR14 General Purpose Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACMP1_CMP_IGEN_TRIM_DN</name>
              <description>reduces ACMP1 internal bias current by 30%</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP1_CMP_IGEN_TRIM_DN_0</name>
                  <description>no reduce</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1_CMP_IGEN_TRIM_DN_1</name>
                  <description>reduces</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP2_CMP_IGEN_TRIM_DN</name>
              <description>reduces ACMP2 internal bias current by 30%</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP2_CMP_IGEN_TRIM_DN_0</name>
                  <description>no reduce</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP2_CMP_IGEN_TRIM_DN_1</name>
                  <description>reduces</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP3_CMP_IGEN_TRIM_DN</name>
              <description>reduces ACMP3 internal bias current by 30%</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP3_CMP_IGEN_TRIM_DN_0</name>
                  <description>no reduce</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP3_CMP_IGEN_TRIM_DN_1</name>
                  <description>reduces</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP4_CMP_IGEN_TRIM_DN</name>
              <description>reduces ACMP4 internal bias current by 30%</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP4_CMP_IGEN_TRIM_DN_0</name>
                  <description>no reduce</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP4_CMP_IGEN_TRIM_DN_1</name>
                  <description>reduces</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP1_CMP_IGEN_TRIM_UP</name>
              <description>increases ACMP1 internal bias current by 30%</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP1_CMP_IGEN_TRIM_UP_0</name>
                  <description>no increase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1_CMP_IGEN_TRIM_UP_1</name>
                  <description>increases</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP2_CMP_IGEN_TRIM_UP</name>
              <description>increases ACMP2 internal bias current by 30%</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP2_CMP_IGEN_TRIM_UP_0</name>
                  <description>no increase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP2_CMP_IGEN_TRIM_UP_1</name>
                  <description>increases</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP3_CMP_IGEN_TRIM_UP</name>
              <description>increases ACMP3 internal bias current by 30%</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP3_CMP_IGEN_TRIM_UP_0</name>
                  <description>no increase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP3_CMP_IGEN_TRIM_UP_1</name>
                  <description>increases</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP4_CMP_IGEN_TRIM_UP</name>
              <description>increases ACMP4 internal bias current by 30%</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP4_CMP_IGEN_TRIM_UP_0</name>
                  <description>no increase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP4_CMP_IGEN_TRIM_UP_1</name>
                  <description>increases</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP1_SAMPLE_SYNC_EN</name>
              <description>ACMP1 sample_lv source select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP1_SAMPLE_SYNC_EN_0</name>
                  <description>select XBAR output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1_SAMPLE_SYNC_EN_1</name>
                  <description>select synced sample_lv</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP2_SAMPLE_SYNC_EN</name>
              <description>ACMP2 sample_lv source select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP2_SAMPLE_SYNC_EN_0</name>
                  <description>select XBAR output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP2_SAMPLE_SYNC_EN_1</name>
                  <description>select synced sample_lv</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP3_SAMPLE_SYNC_EN</name>
              <description>ACMP3 sample_lv source select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP3_SAMPLE_SYNC_EN_0</name>
                  <description>select XBAR output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP3_SAMPLE_SYNC_EN_1</name>
                  <description>select synced sample_lv</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP4_SAMPLE_SYNC_EN</name>
              <description>ACMP4 sample_lv source select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP4_SAMPLE_SYNC_EN_0</name>
                  <description>select XBAR output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP4_SAMPLE_SYNC_EN_1</name>
                  <description>select synced sample_lv</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR15</name>
          <description>GPR15 General Purpose Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPR16</name>
          <description>GPR16 General Purpose Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXRAM_BANK_CFG_SEL</name>
              <description>FlexRAM bank config source select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXRAM_BANK_CFG_SEL_0</name>
                  <description>use fuse value to config</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXRAM_BANK_CFG_SEL_1</name>
                  <description>use FLEXRAM_BANK_CFG to config</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_INIT_VTOR</name>
              <description>Vector table offset register out of reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR17</name>
          <description>GPR17 General Purpose Register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXRAM_BANK_CFG</name>
              <description>FlexRAM bank config value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR18</name>
          <description>GPR18 General Purpose Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R0_BOT</name>
              <description>lock M7_APC_AC_R0_BOT field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R0_BOT_0</name>
                  <description>M7_APC_AC_R0_BOT is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R0_BOT_1</name>
                  <description>M7_APC_AC_R0_BOT is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R0_BOT</name>
              <description>Access Permission Controller (APC) end address of memory region-0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR19</name>
          <description>GPR19 General Purpose Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R0_TOP</name>
              <description>lock M7_APC_AC_R0_TOP field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R0_TOP_0</name>
                  <description>M7_APC_AC_R0_TOP is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R0_TOP_1</name>
                  <description>M7_APC_AC_R0_TOP is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R0_TOP</name>
              <description>Access Permission Controller (APC) start address of memory region-0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR20</name>
          <description>GPR20 General Purpose Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R1_BOT</name>
              <description>lock M7_APC_AC_R1_BOT field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R1_BOT_0</name>
                  <description>M7_APC_AC_R1_BOT is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R1_BOT_1</name>
                  <description>M7_APC_AC_R1_BOT is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R1_BOT</name>
              <description>Access Permission Controller (APC) end address of memory region-1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR21</name>
          <description>GPR21 General Purpose Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R1_TOP</name>
              <description>lock M7_APC_AC_R1_TOP field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R1_TOP_0</name>
                  <description>M7_APC_AC_R1_TOP is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R1_TOP_1</name>
                  <description>M7_APC_AC_R1_TOP is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R1_TOP</name>
              <description>Access Permission Controller (APC) start address of memory region-1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR22</name>
          <description>GPR22 General Purpose Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R2_BOT</name>
              <description>lock M7_APC_AC_R2_BOT field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_BOT_0</name>
                  <description>M7_APC_AC_R2_BOT is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_BOT_1</name>
                  <description>M7_APC_AC_R2_BOT is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R2_BOT</name>
              <description>Access Permission Controller (APC) end address of memory region-2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR23</name>
          <description>GPR23 General Purpose Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R2_TOP</name>
              <description>lock M7_APC_AC_R2_TOP field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_TOP_0</name>
                  <description>M7_APC_AC_R2_TOP is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_TOP_1</name>
                  <description>M7_APC_AC_R2_TOP is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R2_TOP</name>
              <description>Access Permission Controller (APC) start address of memory region-2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR24</name>
          <description>GPR24 General Purpose Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK_M7_APC_AC_R3_BOT</name>
              <description>lock M7_APC_AC_R3_BOT field for changes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_BOT_0</name>
                  <description>M7_APC_AC_R3_BOT is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_BOT_1</name>
                  <description>M7_APC_AC_R3_BOT is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R3_BOT</name>
              <description>Access Permission Controller (APC) end address of memory region-3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
