nxp-mcuxpresso/mcux-soc-svd/MIMXRT1021/MIMXRT1021.xml
        <register>
          <name>CFG</name>
          <description>Configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADICLK</name>
              <description>Input Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADICLK_0</name>
                  <description>IPG clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADICLK_1</name>
                  <description>IPG clock divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADICLK_3</name>
                  <description>Asynchronous clock (ADACK)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Conversion Mode Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_0</name>
                  <description>8-bit conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1</name>
                  <description>10-bit conversion</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_2</name>
                  <description>12-bit conversion</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADLSMP</name>
              <description>Long Sample Time Configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADLSMP_0</name>
                  <description>Short sample mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADLSMP_1</name>
                  <description>Long sample mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADIV</name>
              <description>Clock Divide Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADIV_0</name>
                  <description>Input clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADIV_1</name>
                  <description>Input clock / 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADIV_2</name>
                  <description>Input clock / 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADIV_3</name>
                  <description>Input clock / 8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADLPC</name>
              <description>Low-Power Configuration</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADLPC_0</name>
                  <description>ADC hard block not in low power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADLPC_1</name>
                  <description>ADC hard block in low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADSTS</name>
              <description>Defines the total sample time duration in number of full cycles</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADSTS_0</name>
                  <description>Sample period (ADC clocks) = 3 if ADLSMP=0b Sample period (ADC clocks) = 13 if ADLSMP=1b</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADSTS_1</name>
                  <description>Sample period (ADC clocks) = 5 if ADLSMP=0b Sample period (ADC clocks) = 17 if ADLSMP=1b</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADSTS_2</name>
                  <description>Sample period (ADC clocks) = 7 if ADLSMP=0b Sample period (ADC clocks) = 21 if ADLSMP=1b</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADSTS_3</name>
                  <description>Sample period (ADC clocks) = 9 if ADLSMP=0b Sample period (ADC clocks) = 25 if ADLSMP=1b</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADHSC</name>
              <description>High Speed Configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADHSC_0</name>
                  <description>Normal conversion selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADHSC_1</name>
                  <description>High speed conversion selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Voltage Reference Selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFSEL_0</name>
                  <description>Selects VREFH/VREFL as reference voltage.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADTRG</name>
              <description>Conversion Trigger Select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADTRG_0</name>
                  <description>Software trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADTRG_1</name>
                  <description>Hardware trigger selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGS</name>
              <description>Hardware Average select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVGS_0</name>
                  <description>4 samples averaged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_1</name>
                  <description>8 samples averaged</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_2</name>
                  <description>16 samples averaged</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGS_3</name>
                  <description>32 samples averaged</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVWREN</name>
              <description>Data Overwrite Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVWREN_0</name>
                  <description>Disable the overwriting. Existing Data in Data result register will not be overwritten by subsequent converted data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVWREN_1</name>
                  <description>Enable the overwriting.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GC</name>
          <description>General control register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADACKEN</name>
              <description>Asynchronous clock output enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADACKEN_0</name>
                  <description>Asynchronous clock output disabled; Asynchronous clock only enabled if selected by ADICLK and a conversion is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADACKEN_1</name>
                  <description>Asynchronous clock and clock output enabled regardless of the state of the ADC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAEN_0</name>
                  <description>DMA disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAEN_1</name>
                  <description>DMA enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACREN</name>
              <description>Compare Function Range Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACREN_0</name>
                  <description>Range function disabled. Only the compare value 1 of ADC_CV register (CV1) is compared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACREN_1</name>
                  <description>Range function enabled. Both compare values of ADC_CV registers (CV1 and CV2) are compared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACFGT</name>
              <description>Compare Function Greater Than Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACFGT_0</name>
                  <description>Configures &quot;Less Than Threshold, Outside Range Not Inclusive and Inside Range Not Inclusive&quot; functionality based on the values placed in the ADC_CV register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACFGT_1</name>
                  <description>Configures &quot;Greater Than Or Equal To Threshold, Outside Range Inclusive and Inside Range Inclusive&quot; functionality based on the values placed in the ADC_CV registers.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACFE</name>
              <description>Compare Function Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACFE_0</name>
                  <description>Compare function disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACFE_1</name>
                  <description>Compare function enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVGE</name>
              <description>Hardware average enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVGE_0</name>
                  <description>Hardware average function disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVGE_1</name>
                  <description>Hardware average function enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCO</name>
              <description>Continuous Conversion Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCO_0</name>
                  <description>One conversion or one set of conversions if the hardware average function is enabled (AVGE=1) after initiating a conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCO_1</name>
                  <description>Continuous conversions or sets of conversions if the hardware average function is enabled (AVGE=1) after initiating a conversion.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAL</name>
              <description>Calibration</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GS</name>
          <description>General status register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADACT</name>
              <description>Conversion Active</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADACT_0</name>
                  <description>Conversion not in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADACT_1</name>
                  <description>Conversion in progress.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALF</name>
              <description>Calibration Failed Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CALF_0</name>
                  <description>Calibration completed normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALF_1</name>
                  <description>Calibration failed. ADC accuracy specifications are not guaranteed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWKST</name>
              <description>Asynchronous wakeup interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AWKST_0</name>
                  <description>No asynchronous interrupt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWKST_1</name>
                  <description>Asynchronous wake up interrupt occurred in stop mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CV</name>
          <description>Compare value register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CV1</name>
              <description>Compare Value 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CV2</name>
              <description>Compare Value 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OFS</name>
          <description>Offset correction value register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFS</name>
              <description>Offset value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIGN</name>
              <description>Sign bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIGN_0</name>
                  <description>The offset value is added with the raw result</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIGN_1</name>
                  <description>The offset value is subtracted from the raw converted value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL</name>
          <description>Calibration value register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAL_CODE</name>
              <description>Calibration Result Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
