nxp-mcuxpresso/mcux-soc-svd/MIMXRT1021/MIMXRT1021.xml
        <register>
          <name>CTRL_SET</name>
          <description>USB PHY General Control Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0200000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENOTG_ID_CHG_IRQ</name>
              <description>Enable OTG_ID_CHG_IRQ.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENHOSTDISCONDETECT</name>
              <description>For host mode, enables high-speed disconnect detector</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQHOSTDISCON</name>
              <description>Enables interrupt for detection of disconnection to Device when in high-speed host mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOSTDISCONDETECT_IRQ</name>
              <description>Indicates that the device has disconnected in high-speed mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDEVPLUGINDETECT</name>
              <description>For device mode, enables 200-KOhm pullups for detecting connectivity to the host.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVPLUGIN_POLARITY</name>
              <description>For device mode, if this bit is cleared to 0, then it trips the interrupt if the device is plugged in</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_ID_CHG_IRQ</name>
              <description>OTG ID change interrupt. Indicates the value of ID pin changed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENOTGIDDETECT</name>
              <description>Enables circuit to detect resistance of MiniAB ID pin.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUMEIRQSTICKY</name>
              <description>Set to 1 will make RESUME_IRQ bit a sticky bit until software clear it</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQRESUMEDETECT</name>
              <description>Enables interrupt for detection of a non-J state on the USB line</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUME_IRQ</name>
              <description>Indicates that the host is sending a wake-up after suspend</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQDEVPLUGIN</name>
              <description>Enables interrupt for the detection of connectivity to the USB line.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVPLUGIN_IRQ</name>
              <description>Indicates that the device is connected</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_ON_LRADC</name>
              <description>Enables the LRADC to monitor USB_DP and USB_DM. This is for use in non-USB modes only.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENUTMILEVEL2</name>
              <description>Enables UTMI+ Level2. This should be enabled if needs to support LS device</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENUTMILEVEL3</name>
              <description>Enables UTMI+ Level3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQWAKEUP</name>
              <description>Enables interrupt for the wakeup events.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_IRQ</name>
              <description>Indicates that there is a wakeup event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTO_PWRON_PLL</name>
              <description>Enables the feature to auto-enable the POWER bit of HW_CLKCTRL_PLLxCTRL0 if there is wakeup event if USB is suspended</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTOCLR_CLKGATE</name>
              <description>Enables the feature to auto-clear the CLKGATE bit if there is wakeup event while USB is suspended</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTOCLR_PHY_PWD</name>
              <description>Enables the feature to auto-clear the PWD register bits in USBPHYx_PWD if there is wakeup event while USB is suspended</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPDMCHG_WKUP</name>
              <description>Enables the feature to wakeup USB if DP/DM is toggled when USB is suspended</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIDCHG_WKUP</name>
              <description>Enables the feature to wakeup USB if ID is toggled when USB is suspended.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENVBUSCHG_WKUP</name>
              <description>Enables the feature to wakeup USB if VBUS is toggled when USB is suspended.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSDLL_RST_EN</name>
              <description>Enables the feature to reset the FSDLL lock detection logic at the end of each TX packet.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTG_ID_VALUE</name>
              <description>Almost same as OTGID_STATUS in USBPHYx_STATUS Register</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOST_FORCE_LS_SE0</name>
              <description>Forces the next FS packet that is transmitted to have a EOP with LS timing</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_SUSPENDM</name>
              <description>Used by the PHY to indicate a powered-down state</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>Gate UTMI Clocks</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Writing a 1 to this bit will soft-reset the USBPHYx_PWD, USBPHYx_TX, USBPHYx_RX, and USBPHYx_CTRL registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_CLR</name>
          <description>USB PHY General Control Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0200000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENOTG_ID_CHG_IRQ</name>
              <description>Enable OTG_ID_CHG_IRQ.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENHOSTDISCONDETECT</name>
              <description>For host mode, enables high-speed disconnect detector</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQHOSTDISCON</name>
              <description>Enables interrupt for detection of disconnection to Device when in high-speed host mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOSTDISCONDETECT_IRQ</name>
              <description>Indicates that the device has disconnected in high-speed mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDEVPLUGINDETECT</name>
              <description>For device mode, enables 200-KOhm pullups for detecting connectivity to the host.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVPLUGIN_POLARITY</name>
              <description>For device mode, if this bit is cleared to 0, then it trips the interrupt if the device is plugged in</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTG_ID_CHG_IRQ</name>
              <description>OTG ID change interrupt. Indicates the value of ID pin changed.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENOTGIDDETECT</name>
              <description>Enables circuit to detect resistance of MiniAB ID pin.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUMEIRQSTICKY</name>
              <description>Set to 1 will make RESUME_IRQ bit a sticky bit until software clear it</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQRESUMEDETECT</name>
              <description>Enables interrupt for detection of a non-J state on the USB line</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESUME_IRQ</name>
              <description>Indicates that the host is sending a wake-up after suspend</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQDEVPLUGIN</name>
              <description>Enables interrupt for the detection of connectivity to the USB line.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVPLUGIN_IRQ</name>
              <description>Indicates that the device is connected</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_ON_LRADC</name>
              <description>Enables the LRADC to monitor USB_DP and USB_DM. This is for use in non-USB modes only.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENUTMILEVEL2</name>
              <description>Enables UTMI+ Level2. This should be enabled if needs to support LS device</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENUTMILEVEL3</name>
              <description>Enables UTMI+ Level3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIRQWAKEUP</name>
              <description>Enables interrupt for the wakeup events.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUP_IRQ</name>
              <description>Indicates that there is a wakeup event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTO_PWRON_PLL</name>
              <description>Enables the feature to auto-enable the POWER bit of HW_CLKCTRL_PLLxCTRL0 if there is wakeup event if USB is suspended</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTOCLR_CLKGATE</name>
              <description>Enables the feature to auto-clear the CLKGATE bit if there is wakeup event while USB is suspended</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENAUTOCLR_PHY_PWD</name>
              <description>Enables the feature to auto-clear the PWD register bits in USBPHYx_PWD if there is wakeup event while USB is suspended</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPDMCHG_WKUP</name>
              <description>Enables the feature to wakeup USB if DP/DM is toggled when USB is suspended</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENIDCHG_WKUP</name>
              <description>Enables the feature to wakeup USB if ID is toggled when USB is suspended.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENVBUSCHG_WKUP</name>
              <description>Enables the feature to wakeup USB if VBUS is toggled when USB is suspended.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSDLL_RST_EN</name>
              <description>Enables the feature to reset the FSDLL lock detection logic at the end of each TX packet.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTG_ID_VALUE</name>
              <description>Almost same as OTGID_STATUS in USBPHYx_STATUS Register</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOST_FORCE_LS_SE0</name>
              <description>Forces the next FS packet that is transmitted to have a EOP with LS timing</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTMI_SUSPENDM</name>
              <description>Used by the PHY to indicate a powered-down state</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>Gate UTMI Clocks</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Writing a 1 to this bit will soft-reset the USBPHYx_PWD, USBPHYx_TX, USBPHYx_RX, and USBPHYx_CTRL registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
